USER_LENGTH_LIMIT = 150
EMAIL_LENGTH_LIMIT = 254

PER_PAGE_LIMIT = 6

TAG_LENGTH_LIMIT = 32
RECIPE_LENGTH_LIMIT = 256

INGREDIENT_LENGTH_LIMIT = 128
UNIT_LENGTH_LIMIT = 64

# ERROR_MESSAGE = {
#     'Ошибка валидации года': (
#         'Данный год выпуска произведения больше текущего.'
#     ),
#     'Ошибка имени пользователя': (
#         'Данное имя пользователя занято. Выберите другое.'
#     ),
#     'Ошибка допустимых символов': (
#         'Имя пользователя содержит недопустимые символы.'
#     ),
#     'Ошибка отзыва': (
#         'Нельзя добавить больше одного отзыва.'
#     )
# }